research/slides-handouts.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-04-05 Tue 13:13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Slides and handouts</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/patrickdelliott.css" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.15.1/dist/katex.min.css" integrity="sha384-R4558gYOUz8mP9YWpZJjofhk+zx0AS11p36HnD2ZKj/6JR5z27gSSULCNHIRReVs" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<nav id="preamble" class="status">
<a class="active" href="/">Home</a>
<a href="/research/papers.html">Papers</a>
<a href="/research/slides-handouts.html">Talks</a>
<a href="/teaching.html">Teaching</a>
<a href="/resources.html">Resources</a>
<!-- <a href="https://blog.patrickdelliott.com">Blog</a> -->
<!-- <a href="https://notes.patrickdelliott.com">Notes</a> -->
</nav>
<main id="content" class="content">
<header>
<h1 class="title">Slides and handouts</h1>
</header>
<section id="outline-container-org0c8fabe" class="outline-2">
<h2 id="org0c8fabe">2022</h2>
<div class="outline-text-2" id="text-org0c8fabe">
<ul class="org-ul">
<li><b>Disjunction in a predictive theory of anaphora</b>
<ul class="org-ul">
<li>TLLM III</li>
<li><a href="file:///home/patrl/repos/patrl.github.io/content/pdf/tllm-slides.pdf">Slides</a></li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-orgf9607dc" class="outline-2">
<h2 id="orgf9607dc">2021</h2>
<div class="outline-text-2" id="text-orgf9607dc">
<ul class="org-ul">
<li><b>Meaning in linguistic theory: formal semantics and Montague grammar</b>
<ul class="org-ul">
<li>MIT Quest meaning representation workshop, September 11.</li>
<li><a href="https://patrl.keybase.pub/slides/quest-workshop-handout.pdf">Slides</a></li>
</ul></li>
<li><b>Intensionalizing abstract meaning representations: non-veridicality and scope</b>
<ul class="org-ul">
<li>Joint work with Greg Williamson and Yuxin Ji.</li>
<li>Talk given at the LAW-DMR 2021 workshop, November 10-11.</li>
<li><a href="https://arxiv.org/pdf/2109.09858.pdf">Paper</a></li>
</ul></li>
<li><b>A scopal theory of pied-piping in relative clauses</b>
<ul class="org-ul">
<li>Talk given at NELS 52.</li>
<li><a href="https://osf.io/gfeky/">Handout</a></li>
</ul></li>
<li><b>Externally dynamic dynamic semantics</b>
<ul class="org-ul">
<li>Talk given at ENS, July 14.</li>
<li><a href="https://patrl.keybase.pub/handouts/ens.pdf">Handout</a></li>
</ul></li>
<li><b>Trivalent foundations for a logic of anaphora</b>
<ul class="org-ul">
<li>Invited job talk given at MIT.</li>
<li><a href="http://patrickdelliott.com/mit-job-talk">Slides</a></li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-org81bdf86" class="outline-2">
<h2 id="org81bdf86">2020</h2>
<div class="outline-text-2" id="text-org81bdf86">
<ul class="org-ul">
<li><b>What linguists can learn from functional programmers: a study in opacity and environment sensitivity</b>
<ul class="org-ul">
<li>Talk given at MIT CompLang, December 8.</li>
</ul></li>
<li><b>Classical negation in a dynamic alternative semantics</b>
<ul class="org-ul">
<li>Invited talk at LENLS 17.</li>
<li><a href="https://patrl.keybase.pub/slides/lenls2020.pdf">Slides</a></li>
</ul></li>
<li><b>Coreference, negation, and modal subordination</b>
<ul class="org-ul">
<li>Talk at Rutgers SURGE meeting, October 27.</li>
</ul></li>
<li><b>Crossover and the dynamics of negation</b>
<ul class="org-ul">
<li>Talk at NYU semantics group, October 9.</li>
</ul></li>
<li><b>Generalized crossover</b>
<ul class="org-ul">
<li>Joint work with Yasu Sudo.</li>
<li>Talk given at SALT</li>
<li><a href="https://osf.io/4sp3g/">Slides</a></li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-orgfffab8d" class="outline-2">
<h2 id="orgfffab8d">2019</h2>
<div class="outline-text-2" id="text-orgfffab8d">
<ul class="org-ul">
<li><b>Nesting habits of flightless <i>wh</i>-expressions</b>
<ul class="org-ul">
<li>Invited talk given at the workshop <i>Complex wh-expressions</i> in Nantes.</li>
<li><a href="https://patrl.keybase.pub/slides/nantes.pdf">Slides</a></li>
</ul></li>
<li><b>Two souls of disjunction</b>
<ul class="org-ul">
<li>Talk given at the workshop <i>Asymmetries in language: presuppositions and beyond</i> in Berlin.</li>
<li><a href="https://patrl.keybase.pub/slides/berlin-disj.pdf">Slides</a></li>
</ul></li>
<li><b>Binding back to the future</b>
<ul class="org-ul">
<li>Joint work with Yasu Sudo.</li>
<li>Talk given at the workshop <i>Asymmetries in language: presuppositions and beyond</i> in Berlin.</li>
<li><a href="https://patrl.keybase.pub/slides/berlin-cataphora.pdf">Slides</a></li>
</ul></li>
<li><b>Nuclear intervention: deriving Beck effects via cyclic scope and local exhaustification</b>
<ul class="org-ul">
<li>Joint work with Uli Sauerland.</li>
<li>Talk given at the workshop <i>Exhaustivity in questions and answers</i> in Tübingen.</li>
<li><a href="https://patrl.keybase.pub/slides/tuebingen-slides.pdf">Slides</a></li>
</ul></li>
<li><b>The dynamics of ellipsis identity</b>
<ul class="org-ul">
<li>Joint work with Yasu Sudo.</li>
<li>Talk given at the workshop SLUICING+@50 in Chicago.</li>
</ul></li>
<li><b><i>Fuck</i> compositionality</b>
<ul class="org-ul">
<li>Invited talk at the DGfS workshop <i>Encoding emotive attitudes in non-truth-conditional meaning</i> in Bremen.</li>
<li><a href="https://patrl.keybase.pub/slides/emoSlides.pdf">Slides</a></li>
</ul></li>
<li><b>Two souls of disjunction: making dynamic semantics (more) explanatory</b>
<ul class="org-ul">
<li>Invited talk at Frankfurt Semantics Colloquium</li>
<li><a href="https://patrl.keybase.pub/handouts/frankfurt.pdf">Handout</a></li>
</ul></li>
<li><b>Movement as higher-order structure building</b>
<ul class="org-ul">
<li>Invited talk at Göttingen.</li>
<li><a href="https://patrl.keybase.pub/slides/goettingen-mvt.pdf">Slides</a></li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-orgaccfce4" class="outline-2">
<h2 id="orgaccfce4">2018</h2>
<div class="outline-text-2" id="text-orgaccfce4">
<ul class="org-ul">
<li><b>Deriving dynamic disjunction</b>
<ul class="org-ul">
<li>Talk given at the FB IV workshop, ZAS Berlin.</li>
</ul></li>
<li><b>Arguments and attitudes</b>
<ul class="org-ul">
<li>Guest lecture at the semantics of attitudes seminar series, UCL.</li>
</ul></li>
<li><b>On Prior's substitution problem</b>
<ul class="org-ul">
<li>Talk given at the UCL workshop on attitude predicates.</li>
</ul></li>
<li><b>Embedded exhaustification and plurality: two case studies</b>
<ul class="org-ul">
<li>Talk given at UCL.</li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-orgd68877e" class="outline-2">
<h2 id="orgd68877e">2017</h2>
<div class="outline-text-2" id="text-orgd68877e">
<ul class="org-ul">
<li><b>An algebraic theory of attitudes</b>
<ul class="org-ul">
<li>Talk given at LENLS 14.</li>
</ul></li>
<li><b>Arguments and attitudes</b>
<ul class="org-ul">
<li>Talk given at the FB IV workshop, ZAS Berlin.</li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-org34af3db" class="outline-2">
<h2 id="org34af3db">2016</h2>
<div class="outline-text-2" id="text-org34af3db">
<ul class="org-ul">
<li><b>Nested <i>which</i>-phrases: consequences for the syntax of <i>wh</i>-scope</b>
<ul class="org-ul">
<li>Talk given at the IGG 42, Lecce.</li>
</ul></li>
<li><b>Nested <i>wh</i>-questions and the locality of scope-taking</b>
<ul class="org-ul">
<li>Talk given at ConSOLE XXIV, York.</li>
</ul></li>
</ul>
</div>
</section>
</main>
</body>
</html>
